app/controllers/user_stocks_controller.rb

SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`ticker` = 'TSLA' ORDER BY `stocks`.`id` ASC LIMIT 1
INSERT INTO `stocks` (`ticker`, `name`, `last_price`, `created_at`, `updated_at`) VALUES ('TSLA', 'Tesla Inc', 1230, '2021-11-02 11:18:42.600980', '2021-11-02 11:18:42.600980')
INSERT INTO `user_stocks` (`user_id`, `stock_id`, `created_at`, `updated_at`) VALUES (1, 4, '2021-11-02 11:18:42.632856', '2021-11-02 11:18:42.632856')
---
  def create
    stock = Stock.check_db(params[:ticker])
    if stock.blank?
      stock = Stock.new_lookup(params[:ticker])
      stock.save
    end
    @user_stock = UserStock.create(user: current_user, stock: stock)